// Створити простенький калькулятор за допомогою класу.
// </p>
// <p>Цей клас буде мати такі методи:</p>
// <ol>
class Calculator {
constructor(a,b,result){
  this.a=a
  this.b=b
  this.result = result
}
//<li>Метод що запитує в користувача 2 числа</li>
inputRequest (a,b){
  this.a = a
  this.b = b
}


}
  
  <li>
    Метод що додає ці числа
  </li>
  <li>Метод що віднімає ці числа</li>
  <li>Метод що перемножує ці числа</li>
  <li>Метод що ділить ці числа</li>
  <li>
    Метод що виводить результат арефметичної операції на екран в
    форматі <code> `Результат операції ${value}`</code>
    <br />
    цей метод запускаєтьсяв кінці кожного з методів 2-5
  </li>
  <li>
    Метод що додає в калькулятор новий функціонал (Приймає
    аргументом колбек в якому описаний новий метод)
  </li>
  <li>
    Передати в метод №7 колбек ф-ю що підносить числа в степінь
  </li>
  <li>Написати всі методи і перевірити чи вони працюють</li>
</ol>
</li>
<li>